app/views/admin/exams/_form.html.erb

SELECT `categories`.* FROM `categories` WHERE `categories`.`id` = 2 LIMIT 1
---
        @subject.id = params[:subject]['id'].to_i
        @categories = Category.where('subject_id = ?', @subject.id)

SELECT `subjects`.* FROM `subjects`
---
    <% end %>
    <%= collection_select(:subject, :id, Subject.all, :id, :name, {:prompt => "Select Subject"}) %>