app/views/admin/exams/_show.html.erb

            <%
              examquestion = Examquestion.where("exam_id = ?", @exam.id)
---
SELECT `examquestions`.* FROM `examquestions` WHERE (exam_id = 1)
SELECT `questions`.* FROM `questions` WHERE `questions`.`id` = 5 LIMIT 1