app/views/admin/questions/_form.html.erb

  if params[:answer] != nil
    count = params[:answer].length
---
SELECT `answers`.* FROM `answers` WHERE `answers`.`question_id` = 27

        @subject.id = params[:subject]['id'].to_i
        @categories = Category.where('subject_id = ?', @subject.id)
---
SELECT `categories`.* FROM `categories` WHERE `categories`.`id` = 1 LIMIT 1

    <% end %>
    <%= collection_select(:subject, :id, Subject.all, :id, :name, {:prompt => "Select Subject"}) %>
---
SELECT `subjects`.* FROM `subjects`