app/controllers/ajax_controller.rb

  def make_ajax_category
  	@categories = Category.joins(:subject).
  			select("categories.id, categories.name").
  			where("subjects.id = ?", params[:id])
---
SELECT categories.id, categories.name FROM `categories` INNER JOIN `subjects` ON `subjects`.`id` = `categories`.`subject_id` WHERE (subjects.id = '2')