app/controllers/mail_controller.rb

SELECT `userexams`.* FROM `userexams` WHERE `userexams`.`id` = 11 LIMIT 1
UPDATE `userexams` SET `email` = 'khactruoc09dce@gmail.com', `updated_at` = '2013-03-01 09:36:37' WHERE `userexams`.`id` = 11
---
  def insertMail
  	params = request.POST
  	email = params[:email]
  	userId = params[:user_id]
  	userExams = Userexam.find(userId)
  	userExams.email = email
  	userExams.save