app/controllers/maintest_controller.rb

  def test_exam
    if session[:username] == nil
      redirect_to '/public/500.html'
    else
      @exam = Exam.find_by_hashid(params[:hashid])

      if @exam != nil
      	# get all questions
        @userexam = Userexam.find_by_password(session[:password])
      	@questions = Examquestion.joins(:question).select("questions.id, questions.content, questions.type_question")
      			.where("examquestions.exam_id = ?", @exam.id)

      	@arr = Array.new
      	i = 0

      	# create @arr include question, answer, ...
      	if @questions != nil
      		@questions.each do |q|
      			@arr[i] = Hash.new
      			@arr[i]['id'] = q.id
      			@arr[i]['type_question'] = q.type_question
      			answer = Answer.joins(:question).select("answers.id, answers.content").where("answers.question_id = ?", q.id)
---
SELECT `exams`.* FROM `exams` WHERE `exams`.`hashid` = '1b6453892473a467d07372d45eb05abc2031647a' LIMIT 1
SELECT `userexams`.* FROM `userexams` WHERE `userexams`.`password` = 'm7vljc' LIMIT 1
SELECT questions.id, questions.content, questions.type_question FROM `examquestions` INNER JOIN `questions` ON `questions`.`id` = `examquestions`.`question_id` WHERE (examquestions.exam_id = 4)
SELECT answers.id, answers.content FROM `answers` INNER JOIN `questions` ON `questions`.`id` = `answers`.`question_id` WHERE (answers.question_id = 14)

  def get_point
    if session[:username] == nil
      redirect_to '/500.html'
    else
        params = request.POST
        params.shift
        params.shift
        id = params[:id]
        exam = Exam.find_by_hashid(params[:hashid])
        params.shift
        params.shift
        params.delete('commit')

        point = 0
        check_open = false

        userexam = Userexam.find(id)

        params.each do |key, value|
          question = Question.select("mark, type_question").where("id = ?", key)

          # trac nghiem 2
          if question[0].type_question == "More correct answers"

            value.join(",")
            answer = Answer.select("mark_type").where("id in (?)", value)
---
SELECT `exams`.* FROM `exams` WHERE `exams`.`hashid` = '1b6453892473a467d07372d45eb05abc2031647a' LIMIT 1
SELECT `userexams`.* FROM `userexams` WHERE `userexams`.`id` = 50 LIMIT 1
SELECT mark, type_question FROM `questions` WHERE (id = '14')
SELECT mark_type FROM `answers` WHERE (id in ('112','113'))

          # cau hoi mo
          elsif question[0].type_question == "Open answer"
            check_open = true
            answer = Answer.joins(:question)
              .select("questions.id")
              .where("questions.id = ?", key)
---
SELECT questions.id FROM `answers` INNER JOIN `questions` ON `questions`.`id` = `answers`.`question_id` WHERE (questions.id = '46')

            tmpanswer.userexam_id = userexam.id
            tmpanswer.question_id = answer[0].id
            tmpanswer.con_answer = value
            tmpanswer.save
---
INSERT INTO `tmpanswers` (`con_answer`, `created_at`, `question_id`, `updated_at`, `userexam_id`) VALUES ('asd', '2012-11-14 04:01:40', 46, '2012-11-14 04:01:40', 50)

          end
        end

        userexam.update_attributes({"sum_point" => point}) if check_open == false
---
UPDATE `userexams` SET `sum_point` = 10.0, `updated_at` = '2013-03-01 17:23:36' WHERE `userexams`.`id` = 11

        time_to_min = (time_finish / 60).floor
        if (time_to_min > 0)
          flash_alert = 'You have completed this test. But you are ' + time_to_min.to_s + ' minute(s) late!'
          userexam.update_attributes({ "tmp_point" => point, "time_end" => time_end, "note" => time_to_min.to_s + " minute(s) late!" })
---
UPDATE `userexams` SET `tmp_point` = 15.0, `time_end` = '2012-11-14 04:01:40', `note` = 'Completed on time!', `updated_at` = '2012-11-14 04:01:40' WHERE `userexams`.`id` = 50