app/controllers/sessions_controller.rb

  def new
    if session[:username] != nil && params[:hashid] != nil
      redirect_to '/test/' + params[:hashid]
    end

    @exam = Exam.find_by_hashid(params[:hashid])
---
SELECT `exams`.* FROM `exams` WHERE `exams`.`hashid` = 'da4b9237bacccdf19c0760cab7aec4a8359010b0' LIMIT 1

  def create
    @userexam = Userexam.find_by_password(params[:password])

    if params[:name] == "" || @userexam == nil || @userexam.exam.hashid != params[:hashid]
  		flash.now[:alert] = "Invalid Name/Password"
      render 'new'
    else
      if @userexam.name == nil
        @userexam.name = params[:name]
        @userexam.time_start = Time.now
        @userexam.save
---
SELECT `userexams`.* FROM `userexams` WHERE `userexams`.`password` = 'm7vljc' LIMIT 1
UPDATE `userexams` SET `name` = 'viet', `time_start` = '2012-11-14 04:00:15', `updated_at` = '2012-11-14 04:00:15' WHERE `userexams`.`id` = 50